chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/tmr/processor/tmr_p32mx550f256h.h
PLIB_INLINE_API uint16_t PLIB_TMR_PrescaleGet(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_PrescaleGet_Default(index);
        case TMR_ID_2 :
            return TMR_PrescaleGet_Default(index);
        case TMR_ID_4 :
            return TMR_PrescaleGet_Default(index);
        case TMR_ID_3 :
            return TMR_PrescaleGet_Default(index);
        case TMR_ID_5 :
            return TMR_PrescaleGet_Default(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsPrescale(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_ID_2 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_ID_4 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_ID_3 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_ID_5 :
            return TMR_ExistsPrescale_Default(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_ClockSourceExternalSyncEnable(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_ClockSourceExternalSyncEnable_Inverted(index);
            break;
        case TMR_ID_2 :
            TMR_ClockSourceExternalSyncEnable_Unsupported(index);
            break;
        case TMR_ID_4 :
            TMR_ClockSourceExternalSyncEnable_Unsupported(index);
            break;
        case TMR_ID_3 :
            TMR_ClockSourceExternalSyncEnable_Unsupported(index);
            break;
        case TMR_ID_5 :
            TMR_ClockSourceExternalSyncEnable_Unsupported(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_TMR_ClockSourceExternalSyncDisable(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_ClockSourceExternalSyncDisable_Inverted(index);
            break;
        case TMR_ID_2 :
            TMR_ClockSourceExternalSyncDisable_Unsupported(index);
            break;
        case TMR_ID_4 :
            TMR_ClockSourceExternalSyncDisable_Unsupported(index);
            break;
        case TMR_ID_3 :
            TMR_ClockSourceExternalSyncDisable_Unsupported(index);
            break;
        case TMR_ID_5 :
            TMR_ClockSourceExternalSyncDisable_Unsupported(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsClockSourceSync(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsClockSourceSync_Inverted(index);
        case TMR_ID_2 :
            return TMR_ExistsClockSourceSync_Unsupported(index);
        case TMR_ID_4 :
            return TMR_ExistsClockSourceSync_Unsupported(index);
        case TMR_ID_3 :
            return TMR_ExistsClockSourceSync_Unsupported(index);
        case TMR_ID_5 :
            return TMR_ExistsClockSourceSync_Unsupported(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_Mode16BitEnable(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_Mode16BitEnable_Unsupported(index);
            break;
        case TMR_ID_2 :
            TMR_Mode16BitEnable_Default(index);
            break;
        case TMR_ID_4 :
            TMR_Mode16BitEnable_Default(index);
            break;
        case TMR_ID_3 :
            TMR_Mode16BitEnable_Unsupported(index);
            break;
        case TMR_ID_5 :
            TMR_Mode16BitEnable_Unsupported(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsMode16Bit(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsMode16Bit_Unsupported(index);
        case TMR_ID_2 :
            return TMR_ExistsMode16Bit_Default(index);
        case TMR_ID_4 :
            return TMR_ExistsMode16Bit_Default(index);
        case TMR_ID_3 :
            return TMR_ExistsMode16Bit_Unsupported(index);
        case TMR_ID_5 :
            return TMR_ExistsMode16Bit_Unsupported(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_Mode32BitEnable(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_Mode32BitEnable_Unsupported(index);
            break;
        case TMR_ID_2 :
            TMR_Mode32BitEnable_Default(index);
            break;
        case TMR_ID_4 :
            TMR_Mode32BitEnable_Default(index);
            break;
        case TMR_ID_3 :
            TMR_Mode32BitEnable_Unsupported(index);
            break;
        case TMR_ID_5 :
            TMR_Mode32BitEnable_Unsupported(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsMode32Bit(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsMode32Bit_Unsupported(index);
        case TMR_ID_2 :
            return TMR_ExistsMode32Bit_Default(index);
        case TMR_ID_4 :
            return TMR_ExistsMode32Bit_Default(index);
        case TMR_ID_3 :
            return TMR_ExistsMode32Bit_Unsupported(index);
        case TMR_ID_5 :
            return TMR_ExistsMode32Bit_Unsupported(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_Start(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_Start_Default(index);
            break;
        case TMR_ID_2 :
            TMR_Start_Default(index);
            break;
        case TMR_ID_4 :
            TMR_Start_Default(index);
            break;
        case TMR_ID_3 :
            TMR_Start_Default(index);
            break;
        case TMR_ID_5 :
            TMR_Start_Default(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

